benchmark/results/spiketest.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: spiketest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10000 max VUs, 51s max duration (incl. graceful stop):
              * default: Up to 10000 looping VUs for 21s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (00.1s), 00001/10000 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 00001/10000 VUs  00.1s/21.0s

running (01.1s), 00001/10000 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 00001/10000 VUs  01.1s/21.0s

running (02.1s), 00468/10000 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 00469/10000 VUs  02.1s/21.0s

running (03.1s), 05470/10000 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 05471/10000 VUs  03.1s/21.0s

running (04.1s), 10000/10000 VUs, 4 complete and 0 interrupted iterations
default   [  19% ] 10000/10000 VUs  04.1s/21.0s

running (05.1s), 10000/10000 VUs, 5 complete and 0 interrupted iterations
default   [  24% ] 10000/10000 VUs  05.1s/21.0s

running (06.1s), 10000/10000 VUs, 5 complete and 0 interrupted iterations
default   [  29% ] 10000/10000 VUs  06.1s/21.0s

running (07.1s), 10000/10000 VUs, 5 complete and 0 interrupted iterations
default   [  34% ] 10000/10000 VUs  07.1s/21.0s

running (08.1s), 10000/10000 VUs, 8 complete and 0 interrupted iterations
default   [  39% ] 10000/10000 VUs  08.1s/21.0s

running (09.1s), 10000/10000 VUs, 10 complete and 0 interrupted iterations
default   [  43% ] 10000/10000 VUs  09.1s/21.0s

running (10.1s), 10000/10000 VUs, 42 complete and 0 interrupted iterations
default   [  48% ] 10000/10000 VUs  10.1s/21.0s

running (11.1s), 10000/10000 VUs, 88 complete and 0 interrupted iterations
default   [  53% ] 10000/10000 VUs  11.1s/21.0s

running (12.1s), 10000/10000 VUs, 150 complete and 0 interrupted iterations
default   [  58% ] 10000/10000 VUs  12.1s/21.0s

running (13.1s), 10000/10000 VUs, 195 complete and 0 interrupted iterations
default   [  62% ] 10000/10000 VUs  13.1s/21.0s

running (14.1s), 10000/10000 VUs, 323 complete and 0 interrupted iterations
default   [  67% ] 10000/10000 VUs  14.1s/21.0s

running (15.1s), 10000/10000 VUs, 408 complete and 0 interrupted iterations
default   [  72% ] 10000/10000 VUs  15.1s/21.0s

running (16.1s), 10000/10000 VUs, 567 complete and 0 interrupted iterations
default   [  77% ] 10000/10000 VUs  16.1s/21.0s

running (17.1s), 10000/10000 VUs, 738 complete and 0 interrupted iterations
default   [  81% ] 10000/10000 VUs  17.1s/21.0s

running (18.1s), 10000/10000 VUs, 788 complete and 0 interrupted iterations
default   [  86% ] 10000/10000 VUs  18.1s/21.0s

running (19.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default   [  91% ] 10000/10000 VUs  19.1s/21.0s

running (20.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default   [  96% ] 10000/10000 VUs  20.1s/21.0s

running (21.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (22.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (23.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (24.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (25.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (26.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (27.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (28.1s), 10000/10000 VUs, 806 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (29.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (30.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (31.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (32.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (33.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (34.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (35.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (36.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (37.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (38.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (39.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (40.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (41.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (42.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (43.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (44.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (45.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (46.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (47.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (48.1s), 09999/10000 VUs, 807 complete and 0 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (49.1s), 09532/10000 VUs, 807 complete and 467 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s

running (50.1s), 04529/10000 VUs, 807 complete and 5470 interrupted iterations
default ↓ [ 100% ] 10000/10000 VUs  21s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95) < 8000' p(95)=12.41s

    http_req_failed
    ✗ 'rate < 0.05' rate=96.90%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=10.55s min=544.82ms med=10.94s max=25.89s p(90)=12.09s p(95)=12.41s
      { expected_response:true }...: avg=9.42s  min=544.82ms med=11.13s max=25.89s p(90)=14.73s p(95)=14.74s
    http_req_failed................: 96.90% 782 out of 807
    http_reqs......................: 807    15.819801/s

    EXECUTION
    iteration_duration.............: avg=12.34s min=544.97ms med=12.93s max=26.09s p(90)=14.84s p(95)=15.29s
    iterations.....................: 807    15.819801/s
    vus............................: 4529   min=1          max=10000
    vus_max........................: 10000  min=10000      max=10000

    NETWORK
    data_received..................: 15 MB  290 kB/s
    data_sent......................: 19 MB  369 kB/s



running (51.0s), 00000/10000 VUs, 807 complete and 9999 interrupted iterations
default ✓ [ 100% ] 00000/10000 VUs  21s